worlderic/dTinyG2/src/motate/STM32_F4xx/STMF4Uart.h
/*
 SamUART.h - Library for the Motate system
 http://github.com/synthetos/motate/

 Copyright (c) 2016 Robert Giseburt

 This file is part of the Motate Library.

 This file ("the software") is free software: you can redistribute it and/or modify
 it under the terms of the GNU General Public License, version 2 as published by the
 Free Software Foundation. You should have received a copy of the GNU General Public
 License, version 2 along with the software. If not, see <http://www.gnu.org/licenses/>.

 As a special exception, you may use this file as part of a software library without
 restriction. Specifically, if other files instantiate templates or use macros or
 inline functions from this file, or you compile this file and link it with  other
 files to produce an executable, this file does not by itself cause the resulting
 executable to be covered by the GNU General Public License. This exception does not
 however invalidate any other reasons why the executable file might be covered by the
 GNU General Public License.

 THE SOFTWARE IS DISTRIBUTED IN THE HOPE THAT IT WILL BE USEFUL, BUT WITHOUT ANY
 WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT
 SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF
 OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 */

#ifndef SAMUART_H_ONCE
#define SAMUART_H_ONCE

#include <MotateUART.h>
#include <MotateBuffer.h>
#include <type_traits>
#include <algorithm> // for std::max, etc.
#include <functional>
#include "stm32f4xx.h"
#include "STMF4DMA.h"


namespace Motate {
    // Convenience template classes for specialization:

    template<pin_number rxPinNumber, pin_number txPinNumber>
    using IsValidUART = typename std::enable_if<
        IsUARTRxPin<rxPinNumber>() &&
        IsUARTTxPin<txPinNumber>() &&
        rxPinNumber != txPinNumber &&
        UARTTxPin<txPinNumber>::moduleId == UARTRxPin<rxPinNumber>::moduleId
	>::type;

    static const char kUARTXOn  = 0x11;
    static const char kUARTXOff = 0x13;

    enum class USART_MODE_t : uint32_t {
        USART_NORMAL    = 0x0
    };

    enum class USCLKS_t : uint32_t {
        MCK = 0x0,
        DIV = 0x1,
        SCK = 0x3
    };

    enum class CHRL_t : uint32_t  {
        CH_5_BIT = 0x0,
        CH_6_BIT = 0x1,
        CH_7_BIT = 0x2,
        CH_8_BIT = 0x3
    };

    enum class PAR_t : uint32_t {
        EVEN        = 0x0,
        ODD         = 0x1,
        SPACE       = 0x2,
        MARK        = 0x3,
        NO          = 0x4,
        MULTIDROP   = 0x6
    };

    enum class NBSTOP_t : uint32_t {
        STOP_1_BIT      = 0x0,
        STOP_1_5_BIT    = 0x1,
        STOP_2_BIT      = 0x2
    };

    enum class CHMODE_t : uint32_t {
        CHMODE_NORMAL       = 0x0,
        AUTOMATIC           = 0x1,
        LOCAL_LOOPBACK      = 0x2,
        REMOTE_LOOPBACK     = 0x3
    };

    // USART peripherals
    template<uint8_t uartPeripheralNumber>
    struct _USARTHardware {

        static constexpr USART_TypeDef * const usart() {
            switch (uartPeripheralNumber) {
                case (0): return USART1;
                case (1): return USART2;
                case (2): return USART3;
            };
        };
        static constexpr uint32_t peripheralId() {
            switch (uartPeripheralNumber) {
                case (0): return 0;
                case (1): return 1;
                case (2): return 2;
            };
            //return (uartPeripheralNumber == 0) ? ID_USART0_DONT_CONFLICT : ID_USART1_DONT_CONFLICT;
        };
        static constexpr IRQn_Type usartIRQ() {
            switch (uartPeripheralNumber) {
                case (0): return USART1_IRQn;
                case (1): return USART2_IRQn;
                case (2): return USART3_IRQn;
            };
//            return (uartPeripheralNumber == 0) ? USART0_IRQn : USART1_IRQn;
        };

        static constexpr const uint8_t uartPeripheralNum=uartPeripheralNumber;

        std::function<void(uint16_t)> _uartInterruptHandler;

        DMA<USART_TypeDef *, uartPeripheralNumber> dma_ {_uartInterruptHandler};
        constexpr const DMA<USART_TypeDef *, uartPeripheralNumber> *dma() { return &dma_; };

        typedef _USARTHardware<uartPeripheralNumber> this_type_t;

        static std::function<void()> _uartInterruptHandlerJumper;
        _USARTHardware()
        {
            // We DON'T init here, because the optimizer is fickle, and will remove this whole area.
            // Instead, we call init from UART<>::init(), so that the optimizer will keep it.
        };



        void init() {
            // init is called once after reset, so clean up after a reset
            //SamCommon::enablePeripheralClock(peripheralId());

            // Reset and disable TX and RX
            ////usart()->US_CR = US_CR_RSTRX | US_CR_RSTTX | US_CR_RXDIS | US_CR_TXDIS;

            // reset PCR to zero
            ////usart()->US_IDR = 0xffffffff; // disable all the things
            //dma()->reset();

            _uartInterruptHandlerJumper = [&]() {
                if (_uartInterruptHandler) {
                    _uartInterruptHandler(getInterruptCause());
                }
            };
        };

        void enable() { /*//usart()->US_CR = US_CR_TXEN | US_CR_RXEN; */};
        void disable () { /*//usart()->US_CR = US_CR_TXDIS | US_CR_RXDIS; */};

        void setOptions(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
            disable();

            // Oversampling is either 8 or 16. Depending on the baud, we may need to select 8x in
            // order to get the error low.

            // For all of the speeds up to and including 230400, 16x multiplier worked fine in testing.
            // All yielded a <1% error in final baud.
            ////usart()->US_BRGR = US_BRGR_CD((((SamCommon::getPeripheralClockFreq() * 10) / (16 * baud)) + 5)/10) | US_BRGR_FP(0);
            ////usart()->US_MR &= ~US_MR_OVER;


            if (options & UARTMode::RTSCTSFlowControl) {
                ////usart()->US_MR = (//usart()->US_MR & ~US_MR_USART_MODE_Msk) | US_MR_USART_MODE_HW_HANDSHAKING;
            } else {
                ////usart()->US_MR = (//usart()->US_MR & ~US_MR_USART_MODE_Msk) | US_MR_USART_MODE_NORMAL;
            }

            if (options & UARTMode::TwoStopBits) {
                ////usart()->US_MR = (//usart()->US_MR & ~(US_MR_NBSTOP_Msk)) | US_MR_NBSTOP_2_BIT;
            } else {
                ////usart()->US_MR = (//usart()->US_MR & ~(US_MR_NBSTOP_Msk)) | US_MR_NBSTOP_1_BIT;
            }

