worlderic/dTinyG2/src/motate/STM32_F4xx/STMF4Uart.h
            if (options & UARTMode::As9Bit) {
                ////usart()->US_MR |= US_MR_MODE9;
            } else {
                ////usart()->US_MR = (//usart()->US_MR & ~(US_MR_MODE9|US_MR_CHRL_Msk)) | static_cast<uint32_t>(CHRL_t::CH_8_BIT);
            }
            if (options & UARTMode::EvenParity) {
                ////usart()->US_MR = (//usart()->US_MR & ~(US_MR_PAR_Msk)) | US_MR_PAR_EVEN;
            } else if (options & UARTMode::OddParity) {
                ////usart()->US_MR = (//usart()->US_MR & ~(US_MR_PAR_Msk)) | US_MR_PAR_ODD;
            } else {
                ////usart()->US_MR = (//usart()->US_MR & ~(US_MR_PAR_Msk)) | US_MR_PAR_NO;
            }

            /* Enable receiver and transmitter */
            enable();

        };

        void setInterrupts(const uint16_t interrupts) {
            if (interrupts != UARTInterrupt::Off) {

                if (interrupts & UARTInterrupt::OnRxDone) {
                    //usart()->US_IER = US_IER_RXRDY;
                } else {
                    //usart()->US_IDR = US_IDR_RXRDY;
                }
                if (interrupts & UARTInterrupt::OnTxDone) {
                    //usart()->US_IER = US_IER_TXRDY;
                } else {
                    //usart()->US_IDR = US_IDR_TXRDY;
                }

                if (interrupts & UARTInterrupt::OnRxTransferDone) {
                    dma()->startRxDoneInterrupts();
                } else {
                    dma()->stopRxDoneInterrupts();
                }
                if (interrupts & UARTInterrupt::OnTxTransferDone) {
                    dma()->startTxDoneInterrupts();
                } else {
                    dma()->stopTxDoneInterrupts();
                }


                /* Set interrupt priority */
                if (interrupts & UARTInterrupt::PriorityHighest) {
                	HAL_NVIC_SetPriority(usartIRQ(), 3, 0);
                }
                else if (interrupts & UARTInterrupt::PriorityHigh) {
                	HAL_NVIC_SetPriority(usartIRQ(), 6, 0);
                }
                else if (interrupts & UARTInterrupt::PriorityMedium) {
                	HAL_NVIC_SetPriority(usartIRQ(), 9, 0);
                }
                else if (interrupts & UARTInterrupt::PriorityLow) {
                	HAL_NVIC_SetPriority(usartIRQ(), 12, 0);
                }
                else if (interrupts & kInterruptPriorityLowest) {
                	HAL_NVIC_SetPriority(usartIRQ(), 15, 0);
                }

                NVIC_EnableIRQ(usartIRQ());
            } else {

                NVIC_DisableIRQ(usartIRQ());
            }
        };

        void setInterruptHandler(std::function<void(uint16_t)> &&handler) {
            _uartInterruptHandler = std::move(handler);
        }

        void _setInterruptTxReady(bool value) {
            if (value) {
                //usart()->US_IER = US_IER_TXRDY;
            } else {
                //usart()->US_IDR = US_IDR_TXRDY;
            }
        };

        void setInterruptRxReady(bool value) {
            if (value) {
                //usart()->US_IER = US_IER_RXRDY;
            } else {
                //usart()->US_IDR = US_IDR_RXRDY;
            }
        };

        void _setInterruptCTSChange(bool value) {
            if (value) {
                //usart()->US_IER = US_IER_CTSIC;
            } else {
                //usart()->US_IDR = US_IDR_CTSIC;
            }
        };

        void setInterruptTxTransferDone(bool value) {
            if (value) {
                dma()->startTxDoneInterrupts();
            } else {
                dma()->stopTxDoneInterrupts();
            }
        };

        void setInterruptRxTransferDone(bool value) {
            if (value) {
                dma()->startRxDoneInterrupts();
            } else {
                dma()->stopRxDoneInterrupts();
            }
        };

        static uint16_t getInterruptCause() { // __attribute__ (( noinline ))
            uint16_t status = UARTInterrupt::Unknown;


            return status;
        }

        int16_t readByte() {

            return -1;
        };

        int16_t writeByte(const char value) {

            return -1;
        };

        void flush() {

            _tx_paused = false;
        };

        void flushRead() {
            // kill any incoming transfers
            //dma()->flushRead();
        };


        // ***** Connection status check (simple)
        bool isConnected() {
            // The cts pin allows to know if we're allowed to send,
            // which gives us a reasonable guess, at least.

            // The USART gives us access to that pin.
            return (0);//usart()->US_CSR & US_CSR_CTS) == 0; // active LOW
        };


        // ***** Handle Tranfers
        bool startRXTransfer(char *buffer, const uint16_t length) {
            return 0;//dma()->startRXTransfer(buffer, length, true);
        };

        char* getRXTransferPosition() {
            return dma()->getRXTransferPosition();
        };

        bool _tx_paused = false;
        bool startTXTransfer(char *buffer, const uint16_t length) {
            return dma()->startTXTransfer(buffer, length, true);
        };

        char* getTXTransferPosition() {
            if (_tx_paused) { return false; }
            return dma()->getTXTransferPosition();
        };

        void pauseTX() {
            _tx_paused = true;
            dma()->disableTx();
        };

        void resumeTX() {
            _tx_paused = false;
            dma()->enableTx();
        };
    };


    // UART peripheral
    template<uint8_t uartPeripheralNumber>
    struct _UARTHardware {

        static constexpr USART_TypeDef * const uart() {
            switch (uartPeripheralNumber) {
                case (0): return USART3;
                case (1): return USART6;

            };
        };
        static constexpr uint32_t peripheralId() {
            switch (uartPeripheralNumber) {
                case (0): return 4;
                case (1): return 5;

