worlderic/dTinyG2/src/motate/STM32_F4xx/STMF4Uart.h
            };
        };
        static constexpr IRQn_Type uartIRQ() {
            switch (uartPeripheralNumber) {
                case (0): return USART3_IRQn;
                case (1): return USART6_IRQn;

            };
        };

        static constexpr const uint8_t uartPeripheralNum=uartPeripheralNumber;

        std::function<void(uint16_t)> _uartInterruptHandler;

        DMA<USART_TypeDef *, uartPeripheralNumber> dma_ {_uartInterruptHandler};
        constexpr const DMA<USART_TypeDef *, uartPeripheralNumber> *dma() { return &dma_; };

        typedef _UARTHardware<uartPeripheralNumber> this_type_t;

        static std::function<void()> _uartInterruptHandlerJumper;


        _UARTHardware()
        {
            // We DON'T init here, because the optimizer is fickle, and will remove this whole area.
            // Instead, we call init from UART<>::init(), so that the optimizer will keep it.
            _uartInterruptHandlerJumper = [&]() {
                if (_uartInterruptHandler) {
                    _uartInterruptHandler(getInterruptCause());
                }
            };
        };


        void init() {
            // init is called once after reset, so clean up after a reset
            //SamCommon::enablePeripheralClock(peripheralId());

            // Reset and disable TX and RX
            //uart()->UART_CR = UART_CR_RSTRX | UART_CR_RSTTX | UART_CR_RXDIS | UART_CR_TXDIS;

            // reset PCR to zero
            ////uart()->UART_IDR = 0xffffffff; // disable all the things
            dma()->reset();
        };

        void enable() { /*//uart()->UART_CR = UART_CR_TXEN | UART_CR_RXEN;*/ };
        void disable () { /*//uart()->UART_CR = UART_CR_TXDIS | UART_CR_RXDIS;*/ };

        void setOptions(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
            disable();

            // Oversampling is either 8 or 16. Depending on the baud, we may need to select 8x in
            // order to get the error low.

            //uart()->UART_BRGR = UART_BRGR_CD(SamCommon::getPeripheralClockFreq() / (16 * baud));

            // No hardware flow control
            // if (options & UARTMode::RTSCTSFlowControl) {
            // } else {
            // }

            // Only 1 stop bit
            // if (options & UARTMode::TwoStopBits) {
            // } else {
            // }

            // Only 8-bit mode
            // if (options & UARTMode::As9Bit) {
            // } else {
            // }

            if (options & UARTMode::EvenParity) {
                //uart()->UART_MR = (//uart()->UART_MR & ~(UART_MR_PAR_Msk)) | UART_MR_PAR_EVEN;
            } else if (options & UARTMode::OddParity) {
                //uart()->UART_MR = (//uart()->UART_MR & ~(UART_MR_PAR_Msk)) | UART_MR_PAR_ODD;
            } else {
                //uart()->UART_MR = (//uart()->UART_MR & ~(UART_MR_PAR_Msk)) | UART_MR_PAR_NO;
            }

            /* Enable receiver and transmitter */
            enable();

        };

        void setInterrupts(const uint16_t interrupts) {
            if (interrupts != UARTInterrupt::Off) {

                if (interrupts & UARTInterrupt::OnRxDone) {
                    //uart()->UART_IER = UART_IER_RXRDY;
                } else {
                    //uart()->UART_IDR = UART_IDR_RXRDY;
                }
                if (interrupts & UARTInterrupt::OnTxDone) {
                    //uart()->UART_IER = UART_IER_TXRDY;
                } else {
                    //uart()->UART_IDR = UART_IDR_TXRDY;
                }

                dma()->setInterrupts(interrupts);

                /* Set interrupt priority */
                if (interrupts & UARTInterrupt::PriorityHighest) {
                    //NVIC_SetPriority(uartIRQ(), 0);
                }
                else if (interrupts & UARTInterrupt::PriorityHigh) {
                    //NVIC_SetPriority(uartIRQ(), 3);
                }
                else if (interrupts & UARTInterrupt::PriorityMedium) {
                    //NVIC_SetPriority(uartIRQ(), 7);
                }
                else if (interrupts & UARTInterrupt::PriorityLow) {
                    //NVIC_SetPriority(uartIRQ(), 11);
                }
                else if (interrupts & kInterruptPriorityLowest) {
                    //NVIC_SetPriority(uartIRQ(), 15);
                }

                //NVIC_EnableIRQ(uartIRQ());
            } else {

                //NVIC_DisableIRQ(uartIRQ());
            }
        };

        void setInterruptHandler(std::function<void(uint16_t)> &&handler) {
            _uartInterruptHandler = std::move(handler);
        }

        void _setInterruptTxReady(bool value) {
            if (value) {
                //uart()->UART_IER = UART_IER_TXRDY;
            } else {
                //uart()->UART_IDR = UART_IDR_TXRDY;
            }
        };

        void setInterruptRxReady(bool value) {
            if (value) {
                //uart()->UART_IER = UART_IER_RXRDY;
            } else {
                //uart()->UART_IDR = UART_IDR_RXRDY;
            }
        };

        void _setInterruptCTSChange(bool value) {
            if (value) {
            } else {
            }
        };

        void setInterruptTxTransferDone(bool value) {
            if (value) {
                dma()->startTxDoneInterrupts();
            } else {
                dma()->stopTxDoneInterrupts();
            }
        };

        void setInterruptRxTransferDone(bool value) {
            if (value) {
                dma()->startRxDoneInterrupts();
            } else {
                dma()->stopRxDoneInterrupts();
            }
        };

        uint16_t getInterruptCause() { // __attribute__ (( noinline ))
            uint16_t status = UARTInterrupt::Unknown;

            return status;
        }

        int16_t readByte() {
            //while (!(//uart()->UART_SR & UART_SR_RXRDY)) { ; }
            return (0);//uart()->UART_RHR & UART_RHR_RXCHR_Msk);
        };

        int16_t writeByte(const char value) {
            //while (!(//uart()->UART_SR & UART_SR_TXRDY)) { ; }
            //uart()->UART_THR = UART_THR_TXCHR(value);
            return 1;
        };

        void flush() {
            // Wait for the buffer to be empty
            //while (!(//uart()->UART_SR & UART_SR_TXEMPTY)) { ; }
        };

        void flushRead() {
            // kill any incoming transfers
            dma()->flushRead();
        };


        // ***** Connection status check (simple)
        bool isConnected() {
            // The cts pin allows to know if we're allowed to send,
            // which gives us a reasonable guess, at least.

            // read the CTS pin
            return true; // assume always for now
        };


